{
  "header": {
    "title": "Welcome to Symbiotic Love ❤️️"
  },
  "accordion": [
    {
      "title": "Brand",
      "content": "Our lifestyle brand promotes the positive impact that we hope to have on the world and our values of hard work, personal ethics, and individual responsibility. We exemplify these values through responsible and ethical sourcing, manufacturing, and shipping, as well as highly accountable individualized services. To learn more, visit our Lifestyle page",
      "image": "./logo11.svg"
    },
    {
      "title": "Web Services",
      "content": "We offer a variety of web and programming services. This includes website design, web development, deployment, hositng, DNS setup, maintenance, CI/CD, SEO optimization, WCAG compliance reviews and optimization, custom software programming, webmaster services, and more! If you have any web or technological need, check out our Web Services page"
    },
    {
      "title": "Shop",
      "content": "To shop our collection of handmade and secondhand goods, and help support us in our mission, check out our shop. We are proud to have built our shop through our developer partnership with Shopify, enabling us to take almost any form of payment as well as have installment payment options for every service and product on our site, including our web services!",
      "image": [
        "/bag.jpg",
        "/esdNeck.jpg",
        "/leafNeck.jpg",
        "/mug.jpg",
        "/pants.jpg",
        "/seaNeck.jpg",
        "/pen.jpg",
        "/set1.jpg",
        "/tol1.jpg"
      ]
    },
    {
      "title": "About",
      "content": "Our names are Matthew and Jessela. Symbiotic Love began because we were tired of the greedy and irreverent behavior of the businesses in our country. We were, and are, tired of the decline of our ethical and moral standards as a whole, and we wanted to be part of the solution, so we opened a business dedicated to practices that put profits second to our mission. Check out our about page to learn more!",
      "image": [
        "/Us1.JPG", 
        "/Us2.jpg"
      ]
    },
    {
      "title": "Contact",
      "contacts": [
        {
          "name": "Support",
          "email": "support@symbiotic.love"
        },
        {
          "name": "Matthew",
          "email": "matthew@symbiotic.love"
        },
        {
          "name": "Jessela",
          "email": "jessela@symbiotic.love"
        }
      ],
      "image": "https://placehold.co/200"
    }
  ],
  "webServices": {
    "webHero": {
      "title": "Symbiotic Web Services",
      "serviceList": [
        "Web Design",
        "Web Development",
        "Web Hosting",
        "E-Commerce Sites",
        "DNS Setup",
        "Logo Design",
        "Brand Building and Consultation",
        "Custom Software",
        "Custom Scripts and CLIs",
        "Webmaster Services",
        "Tech Stack Consultations"
      ],
      "specialtyList": [
        "JavaScript",
        "ReactJS",
        "Redux",
        "React Native",
        "Node.js",
        "Express.js",
        "GSAP",
        "Axios",
        "Python",
        "Flask",
        "Django",
        "Requests",
        "BeautifulSoup4",
        "NLTK",
        "TensorFlow",
        "Numpy",
        "Pandas",
        "MatPlotLib",
        "SciKit-Learn",
        "CSS3",
        "HTML5"
      ]
    }
  },
  "projects": [
    {
      "title": "Web Crawler",
      "content": "A web crawler CLI made with Python for e-commerce sites using NLP and NER to target and filter keywords at a maximum depth of 3 and a maximum number of 50 pages (modular). /cart, /account, /pay, and other common non-product pages are excluded from the crawl, and the 10 most relevant keywords are displayed.",
      "link": "https://github.com/SymbioticLove/Python-Crawler",
      "images": [
         "/crawler.png"
        ],
      "logos": [
        "/pylogo.svg"
      ]
    },
    {
      "title": "Web Scraper",
      "content": "A web scraping program made with Python, currently set up to scrape realtor website bookmarks for listing addresses, realtor name, realtor contact details, and provide a date stamp. After being scraped, bookmarks are moved to a 'scraped' file to prevent multiple scrapes of the same page and the data is saved to a JSON file.",
      "link": "https://github.com/SymbioticLove/Python-Web-Scraper",
      "images": [
        "/scraper1.png",
        "/scraper2.png"
      ],
      "logos": [
        "/pylogo.svg"
      ]
    },
    {
      "title": "Galactic Greenery",
      "content": "A silly and fun landing page promoting Galactic Green Seeds; seeds to grow alien plantlife. This page showcases some keyframe animation effects as well as strong contrast and typographical heirarchy.",
      "link": "https://symbioticlove.github.io/Built-Demo-Product-Page/",
      "images": [
        "/gg1.png",
        "/gg2.png",
        "/gg3.png"
      ],
      "logos": [
        "/reactlogo.svg",
        "/www.png"
      ]
    },
    {
      "title": "Remote Signing Services",
      "content": "Remote Signing Services (RSS) is a client project for mobile notary services in Texas that we are proviidng permanent hosting, updates, and webmaster services for.",
      "link": "http://remotesigningservices.com",
      "images": [
        "/rss1.png",
        "/rss2.png"
      ],
      "logos": [
        "/reactlogo.svg",
        "/www.png"
      ]
    },
    {
      "title": "Paypal Integration",
      "content": "A full PayPal integration (card payments + PayPal) created with Flask and JavaScript using an HTML template to render form fields. PayPal uses a highly secure multi-token authentication process.",
      "link": "https://github.com/SymbioticLove/PayPal-adv-integration/blob/main/app.py",
      "images": [
        "/pp1.png",
        "/pp2.png",
        "/pp3.png",
        "/pp4.png"
      ],
      "logos": [
        "/pylogo.svg",
        "/jslogo.svg"
      ]
    },
    {
      "title": "React Boilerplate",
      "content": "A standard boilerplate React app, set up with a :root in the index.css and shortcuts for easy setup. This type of website is perfect for landing pages, portfolios, business sites, and other projects that do not require a server component.",
      "link": "https://github.com/SymbioticLove/Create-React-App",
      "images": [
        "/react-template.png"
      ],
      "logos": [
        "/reactlogo.svg"
      ]
    },
    {
      "title": "React/Flask Boilerplate",
      "content": "Similar to our React app boilerplate, but with a Flask server proxied and connected as well. Perfect for more complex web applications that require a server component.",
      "link": "https://github.com/SymbioticLove/React-Flask-Boilerplate",
      "images": [
        "/react-flask.png"
      ],
      "logos": [
        "/reactlogo.svg",
        "/pylogo.svg"
      ]
    },
    {
      "title": "Matthew Ford's Portfolio",
      "content": "Our CTO and chief engineer's portfolio website showcasing a variety of tehnical skills and certifications.",
      "link": "https://symbioticlove.github.io/Portfolio/",
      "images": [
        "/folio1.png",
        "/folio2.png",
        "/folio3.png",
        "/folio4.png"
      ],
      "logos": [
        "/reactlogo.svg",
        "/www.png"
      ]
    },
    {
      "title": "AI Author",
      "content": "A simple UI for writing short stories using GPTs API in a variety of different author styles and for a variety of different age groups. Story history is tracked and stories can be viewed in their entirety in a modal and continued or downloaded in a .txt file. You can easily plug in your own API key and use this yourself!",
      "link": "https://github.com/SymbioticLove/InterviewDemo/blob/main/src/App.js",
      "images": [
        "/author1.png",
        "/author2.png",
        "/author3.png",
        "/author4.png",
        "/author5.png"
      ],
      "logos": [
        "/reactlogo.svg"
      ]
    },
    {
      "title": "JSON Parser",
      "content": "A JSON parser created with Node and JavaScript and released to npm, with 100% accuracy on a diverse set of test data. To install, run 'npm install symbioticlove-json-parser'.",
      "link": "https://github.com/SymbioticLove/JSON-Parser",
      "images": [
        "/parser1.png",
        "/parser2.png"
      ],
      "logos": [
        "/jslogo.svg"
      ]
    },
    {
      "title": "WC CLI",
      "content": "A simple CLI designed to count words, characters, lines, or bytes in a text file or from std input if no file is provided.",
      "link": "https://github.com/SymbioticLove/Python-wc-Tool",
      "images": [
        "/wc1.png",
        "/wc2.png",
        "/wc3.png"
      ],
      "logos": [
        "/pylogo.svg"
      ]
    },
    {
      "title": "Recipe Bot",
      "content": "We are training the ultimate kitchen companion using Python's NLTK. Currently, the training script remains non-ideal, but is being worked on.",
      "link": "https://github.com/SymbioticLove/Recipe-Bot-Training",
      "images": [
        "/ai2.png",
        "/ai1.png",
        "/ai3.png",
        "/ai4.png",
        "/ai5.png",
        "/ai6.png"
      ],
      "logos": [
        "/pylogo.svg"
      ]
    },
    {
      "title": "Restaurant POS System",
      "content": "We are creating a POS system to rival Toast and Square. Our POS tracks employeees, orders, discounts, labor, sales, inventory, and more through a React UI and a Flask REST API writing to JSON files to simulate a DB while being fully customizable to the needs and aesthetic of the business. There is also a reporting script to calculate and display these numbers for a selected date or date range.",
      "link": "https://github.com/SymbioticLove/Restaurant-POS-System",
      "images": [
        "/pos1.png",
        "/pos2.png",
        "/pos3.png",
        "/pos4.png",
        "/pos5.png",
        "/pos6.png",
        "/pos7.png",
        "/pos8.png",
        "/pos9.png",
        "/pos10.png",
        "/pos11.png",
        "/pos12.png",
        "/pos13.png"
      ],
      "logos": [
        "/reactlogo.svg",
        "/pylogo.svg"
      ]
    },
    {
      "title": "Windows Metric Suite",
      "content": "A Windows metric suite created with Ruby tracking CPU usage, free and total memory, uptime, disk space, network statistics, and more.",
      "link": "https://github.com/SymbioticLove/Ruby-WinMetricSuite",
      "images": [
        "/metrics1.png",
        "/metrics2.png"
      ],
      "logos": [
        "/rubylogo.png"
      ]
    },
    {
      "title": "PrimeNative",
      "content": "PrimeNative is a refactoring of the PortfolioPrime web app into a Native app using React Native. Through the app, users will be able to view services, schedule an appointment, and manage portfolio updates.",
      "link": "https://github.com/SymbioticLove/PrimeNative/tree/main/PortfolioPrimeApp",
      "images": [
        "/prime1.png"
      ],
      "logos": [
        "/reactlogo.svg",
        "/app.png"
      ]
    },
    {
      "title": "Sourcerer Copy",
      "content": "This React Native app is a copy of the Sourcerer app of old that can analyze GitHub portfolios and visualize the data for potential employers or clientele.",
      "link": "https://github.com/SymbioticLove/Sourcerer-copy/tree/main/NATIVE/dl-native",
      "images": [
        "/source1.png",
        "/source2.png"
      ],
      "logos": [
        "/reactlogo.svg",
        "/app.png"
      ]
    },
    {
      "title": "Calculators",
      "content": "Calculators created in both JavaScript and Python. The Python calculator uses a Tkinter GUI while the JavaScript calculator is an open HTML-embeddable script.",
      "link": "https://github.com/SymbioticLove/JsCalculator",
      "images": [
        "/calc1.png",
        "/calc2.png"
      ],
      "logos": [
        "/jslogo.svg",
        "/pylogo.svg"
      ]
    }
  ],
  "about": {
    "section1" : {
      "name": "Matthew Ford",
      "title": "CEO and CTO",
      "phone": "(912)438-1768",
      "email": "matthew@symbiotic.love"
    },
    "section2" : {
      "name": "Jessela Sproat",
      "title": "CEO and CDO",
      "phone": "(602)663-3005",
      "email": "jessela@symbiotic.love"
    },
    "matthewSkills": [
      { 
        "title": "HTML5", 
        "description": "I am an expert with semantic HTML, as well as modern ways of implementing HTML into websites and web applications",
        "image": "/html.svg"
      },
      { 
        "title": "CSS3",
        "description": "I use CSS flexbox mobile-first styling in almost all of my projects. I am familiar with CSS in JS and Tailwind",
        "image": "/css.png"
      },
      { 
        "title": "JavaScript",
        "description": "I am experienced with vanilla JavaScript and with many common npm libraries including Redux, Axios, GSAP, Node.js, and Express.js",
        "image": "/jslogo.svg"
      },
      { 
        "title": "ReactJS",
        "description": "I am highly experienced with React, webhooks, and related libraries such as Redux and React Native",
        "image": "/reactlogo.svg"
      },
      { 
        "title": "Python",
        "description": "I am highly experienced with Python in many regards, from AI/ML to data visualization and reporting and libraries such as BS4, NLTK, TensorFlow, Pandas, and Numpy",
        "image": "/pylogo.svg"
      },
      { 
        "title": "Flask",
        "description": "I am proficient in creating and using APIs and server components for headless architectures through Python's Flask micro framework",
        "image": "/flasklogo.svg"
      },
      { 
        "title": "Agile Methodology",
        "description": "I am familiar with Agile methodology, Kanban specifically, and use it for all of my projects",
        "image": "/agile.png"
      },
      { 
        "title": "DevOps",
        "description": "I am intricately famailiar with the deployment process for web applications as well as DNS setup and web hosting",
        "image": "/devops.png"
      },
      { 
        "title": "Git",
        "description": "I have over 30 projects and 600,000 bytes of code publicly available on GitHub and am familiar with the web application, desktop application, and CLI, in addition to Actions workflows and Projects",
        "image": "/github.svg"
      },
      { 
        "title": "GPT and LLM's",
        "description": "I have been using LLMs since they first became popular, and have become masterful in interactions with them. I use them daily in my work, and they have saved me hundreds or perhaps thousands of hours",
        "image": "/openai.svg"
      },
      { 
        "title": "MidJourney",
        "description": "I have honed my skills with MidJourney, and am now capable of creating consistent and truly one-of-a-kind artworks for my pages, programs, games, and more",
        "image": "/mj.png"
      },
      { 
        "title": "SEO",
        "description": "I am highly proficient with SEO in many regards including on-page SEO, backlinking, link building, keyword research, content optimization, and UX",
        "image": "/seo.png"
      },
      { 
        "title": "WCAG",
        "description": "I am well-versed in WCAG, and can perform both accessibility reviews and optimization",
        "image": "/accessibility.png"
      },
      { 
        "title": "Copywriting",
        "description": "I am skilled at providing highly professional and concise copywrite for many subjects, especially those involved in portfolio and resume building",
        "image": "/copywriting.png"
      },
      { 
        "title": "Minor Skills",
        "description": "My minor skills include Vue.js, SQL, Rust, Ruby, and Electron. I can write in these languages/frameworks, but am less proficient than in those listed above",
        "image": "/development.png"
      }
    ],
    "jesselaSkills": [
      { 
        "title": "Eating",
        "description": "Eating that good food"
      },
      { 
        "title": "Sleeping", 
        "description": "Sleeping in the sun"
      },
      { 
        "title": "Working", 
        "description": "Working hard af boi at 2 jobs + hustles!"
      }
    ]
  },
  "footer": {
    "starText": "If you're seeing this, something that should be here isn't here yet! Symbiotic.love is still in an early phase of rebuilding. Check back daily, and if you have any suggestions, please send them to feedback@symbiotic.love"
  }
}
